#+BEGIN_EXPORT html
---
layout: page
title: Python built-in function
tagline: " detailed description"
permalink: /python/python-built-in-methods.html
categories: [Python, built-in-methods]
tags: [python, intro, built-in methods]
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+TOC: headlines 2

* Preamble
Python provides a rich set of built-in methods for specific data
types, enabling developers to perform various operations
efficiently. These methods are categorized across different data types
such as numeric, sequence, mapping, set, and others. Here's an
overview of the built-in methods for some common data types.

* Numeric Types (~int, float, complex~)

* Sequence Types (~list, tuple, range~)

List Built-in Methods are next:

- append(x): Add an item to the end of the list;
- extend(iterable): Extend the list by appending elements from the
  iterable;
- insert(i, x): Insert an item at a given position;
- remove(x): Remove the first item from the list whose value is equal
  to x;
- pop([i]): Remove the item at the given position in the list and
  return it. If no index is specified, removes and returns the last
  item in the list;
- clear(): Remove all items from the list;
- index(x[, start[, end]]): Return zero-based index in the list of the
  first item whose value is equal to x;
- count(x): Return the number of times x appears in the list;
- sort(key=None, reverse=False): Sort the items of the list in place;
- reverse(): Reverse the elements of the list in place;
- copy(): Return a shallow copy of the list.

  #+begin_src python :result none :session list_methods
    import unittest
    class TestListMethods(unittest.TestCase):
        def setUp(self):
            self.l = [1, 2, 3]

        def tearDown(self):
            self.l = None

        def test_append(self):
           self.l.append(4)
           self.assertEqual(self.l, [1, 2, 3, 4])

        def test_extend(self):
            self.l.extend([4, 5])
            self.assertEqual(self.l, [1, 2, 3, 4, 5])

        def test_insert(self):
            self.l.insert(1, 10)
            self.assertEqual(self.l, [1, 10, 2, 3])

        def test_remove(self):
            self.l.remove(2)
            self.assertEqual(self.l, [1, 3])


  #+end_src

  #+RESULTS:

  #+begin_src python :session list_methods :export tesults
  unittest.main(exit=False)
  #+end_src

  #+RESULTS:
  : ....
  : ----------------------------------------------------------------------
  : Ran 4 tests in 0.000s
  : 
  : OK

  
* Mapping Type (~dict~)

* Set Types (~set, frozenset~)

* Text Sequence Type (~str~)



